# Сложение матриц
# При сложении матриц A и B получается такая матрица C, каждый элемент которой представляет собой сумму пары
# соответствующих элементов исходных матриц A и B. Складывать можно только матрицы одинаковой размерности (n x m),
# с равным количеством строк и столбцов. Таким образом, математически сумма матриц выглядит так:
#   C[n*m] = A[n*m] + B[n*m]
# Каждый элемент искомой матрицы равен сумме соответствующих элементов заданных матриц:
# c[i][j] = a[i][j] + b[i][j]

# Пример. Даны две матрицы:
A = [[2, -3, 1], [5, 4, -2]]
B = [[4, 2, -5], [-4, 1, 3]]
# Найти сумму матриц A+B.
# Решение. Имеем
A + B == [[2, -3, 1], [5, 4, -2]] + [[4, 2, -5], [-4, 1, 3]] == [[6, -1, -4], [1, 5, 1]]


# Свойства сложения матриц
#   1. Коммутативность – результат сложения матриц не зависит от их перестановки:
#       A + B == B + A
#   2. Ассоциативность – результат сложения матриц не зависит от расстановки скобок:
#       A + (B + C) == (A + B) + C
#   3. Сложение с нулевой матрицей – для любой матрицы существует нейтральный элемент, которым является нулевая матрица,
#       сложение с которым не изменяет исходную матрицу. Нулевая матрица – матрица, все элементы которой имеют нулевое
#       значение:
#       A + 0 == 0 + A == A
#   4. Существование противоположной матрицы – для ненулевой матрицы A всегда есть матрица -A, сложение с которой даст в
#       результате нулевую матрицу:
#       A + (-A) == 0


# Умножение матрицы на число
# Операция умножения матрицы A на число k заключается в построении матрицы kA = [k * a[i][j]]. Умножать на число можно
# матрицы любого размера. В результате умножения получается матрица того же размера, что исходная.'
# Произведение матрицы A на число k – результирующая матрица B = kA того же размера, полученная умножением каждого из
# элементов a[i][j] исходной матрицы на заданное число.

# Пример. Даны матрица A и число k:
A = [[5, -2, 4], [3, 1, -3]]
k = 7
# Найти произведение матрицы и числа.
# Решение. Имеем
k * A == 7 * [[5, -2, 4], [3, 1, -3]] == [[35, -14, 28], [21, 7, -21]]


# Свойства умножения матрицы на число
#   1. Единица – нейтральное число умножения любой матрицы, результат умножения на нейтральное число – исходная матрица:
#       1 * A == A
#   2. Результат умножения любой матрицы на ноль – нулевая матрица, все элементы которой равны нулю:
#       0 * A == 0
#   3. Для матриц одного размера и действительного числа выполняется свойство дистрибутивности умножения относительно
#   сложения:
#       k * (A + B) == k * A + k * B
#   4. Для любой матрицы и суммы действительных чисел выполняется свойство дистрибутивности:
#       (k + n) * A == k * A + n * A
#   5. Для любой матрицы и произведения любых действительных чисел выполняется свойство ассоциативности умножения:
#       (k * n) * A == k * (n * A)


# Умножение матрицы на матрицу
# Умножение двух матриц A и B – вычисление результирующей матрицы C, каждый элемент c[i][j] которой равен сумме
# произведений элементов соответствующих строки первой матрицы a[i][j] и столбца второй матрицы b[i][j].

# Одну матрицу можно умножать на другую только тогда, когда количество столбцов в первой матрице совпадает с количеством
# строк во второй матрице. То есть, матрицы должны быть согласованы по размерности. Результат умножения матрицы размера
# n x m на матрицу размером m x k – матрица размером n x k.

# Итак, произведение матрицы A[n*m] на матрицу B[m*k] – матрица C[n*k], элемент c[i][j] которой, находящийся в i-ой
# строке и j-ом столбце, равен сумме произведений элементов i-ой строки матрицы A на соответствующие элементы j-ого
# столбца матрицы B.

# Каждый элемент матрицы C[n*k] равен:
# c[i][j] == SUM(r=range(1,m)) a[i][r] * b[r][j] == a[i][1] * b[1][j] + a[i][2] * b[2][j] + ... + a[i][m] * b[m][j]
# где r принимает значение от 1 до m.

# Пример. Даны две матрицы A и B:
A = [[2, -3, 1], [5, 4, -2]]
B = [[-7, 5], [2, -1], [4, 3]]
# Найти произведение матриц A *B.
# Решение. При перемножении матрицы A[2*3] на матрицу B[3*2] мы получаем матрицу C[2*2]. Имеем:
c[1][1] == 2 * (-7) + (-3) * 2 + 1 * 4 == -16
c[1][2] == 2 * 5 + (-3) * (-1) + 1 * 3 == 16
c[2][1] == 5 * (-7) + 4 * 2 + (-2) * 4 == -35
c[2][2] == 5 * (-7) + 4 * (-1) + (-2) * 3 == 15
# Таким образом
A * B == [[2, -3, 1], [5, 4, -2]] * [[-7, 5], [2, -1], [4, 3]] == [[-16, 16], [-35, 15]]


# Свойства умножения матриц
#   1. Ассоциативность – (A * B) * C = A * (B * C)
#   2. Дистрибутивность – A * (B + C) = A * B + A * C, (A + B) * C = A * C + B * C
#   3. Ассоциативность и коммутативность относительно умножения на число – (k * A) * B = k * (A * B) = A * (k * B)
#   4. В общем случае умножение матриц не коммутативно – A * B != B * A
