# Вещественные числа
# Как уже было сказано в уроке, объединение рациональных и иррациональных чисел образует множество вещественных чисел.
# Геометрическая интерпретация множества вещественных чисел – это числовая прямая.
# Каждому вещественному числу соответствует определённая точка числовой прямой, и наоборот – каждой точке числовой
# прямой обязательно соответствует некоторое вещественное число. Другими словами, числовая прямая полностью покрыта
# вещественными числами.


# Мнимые числа
# Рассмотрим квадрат произвольного вещественного числа:
#   2 * 2=4
#   (-2) * (-2) = 4
#   0 * 0=0
#   0.1 * 0.1=0.01

# Результат всегда неотрицательное число. Действительно, пусть a – произвольное вещественное число.
# Тогда a * a = a ** 2 ≥ 0. Таким образом, на множестве вещественных чисел, перемножая два одинаковых числа мы всегда
# получаем неотрицательное число (большее, либо равное нулю).

# Представим, что существует число i (не являющееся вещественным), такое, что i * i = i ** 2 =−1.
# Будет ли такое обозначение полезным? Оказывается, да!

# Такие числа в математике называются мнимыми и обозначают их буквой i, от слова imaginary (мнимый, воображаемый).
# Итак, получаем: i ** 2 = -1 ⟹ i = (-1) ** 1/2

# С таким числом (обозначением), можно решать задачи, где требуется извлечь квадратный корень из отрицательного числа.

# Рассмотрим несколько примеров.
# Пример 1. Выразите число (−9) ** 1/2 через i.
# Решение. Согласно введенному обозначению можем записать:
# (-9) ** 1/2 = (9 ** 1/2) * (-1 ** 1/2) = 3i

# Или в общем виде для любого положительного числа x существует равенство:
# (-x) ** 1/2 = (x ** 1/2) * i

# Пример 2. Посчитать значение выражения (5i) ** 2
# Решение. Согласно определению мнимой единицы i ** 2 = -1, получаем:
# (5i) ** 2 = 25 * i ** 2 = 25 * (-1) = -25

# Пример 3. Решите уравнение x ** 2 + 1 = 0
# Решение. Запишем уравнение в виде x ** 2 = -1. Такое уравнение не имеет решений на множестве вещественных чисел.
# Однако уравнение имеет решения на множестве мнимых чисел. Имеем:
# x ** 2 = -1 ⟺ x = ±(-1) ** 2 = ±i


# Мнимая единица
# Число i = (-1) ** 2 называется мнимой единицей. Введение мнимой единицы позволяет расширить множество вещественных
# чисел до множества комплексных чисел.

# Мнимая единица i обладает интересным свойством: каждый раз при умножении на i она "циклически" проходит через 4
# различных значения:
#   1 * i = i
#   i * i = -1
#   -1 * i = -i
#   -i * i = 1

# Получаем равенства натуральных степеней мнимой единицы:
# i=(-1)**2, i**2=-1, i**3=(i**2)*i=-i, i**4=(i**3)*i=1, i**5=(i**4)*i=i, ...

# Несложно посчитать значения для больших показателей:
# i**100=(i**2)**50=(-1)**50=1, i**55=((i**2)**27)*i=-i


# Комплексные числа в математике
# Комплексное число – комбинация вещественного и мнимого числа. Таким образом, число вида a+bi, где a,b – вещественные
# числа, называется комплексным числом.

# Число a – называется вещественной (действительной) частью комплексного числа, а число b – мнимой частью числа.

# Заметим, что действительная (число a) и мнимая (число b) часть комплексного числа a+bi может быть равна нулю:
# Комплексное число   Действительная часть    Мнимая часть    Комментарий
# 3+2i                3                       2
# 7                   7                       0               вещественное число
# -5i                 0                       -5              мнимое число

# Можем ли мы конструировать одно число на основании двух других? Конечно, можем! И уже делали это, когда вводили
# рациональные числа. Дробь (3/7) – конструкция на основании двух натуральных чисел 3 и 7. Комплексное число –
# конструкция на основании вещественного и мнимого числа.

# Комплексным числам нет места на числовой прямой, для них нужна так называемая комплексная плоскость. Для графической
# интерпретации комплексных чисел нам потребуется две взаимно перпендикулярные прямые.
# Горизонтальная прямая (ось) отвечает за действительную часть комплексного числа, вертикальная – за мнимую.
# Любое комплексное число может быть представлено в виде точки на комплексной плоскости.


# Обозначения комплексных чисел
# Kомплексные числа обычно обозначаются буквой z=a+bi. Действительная часть комплексного числа обозначается как
# Re(z)= a, мнимая часть обозначается Im(z)=b.


# Модуль комплексного числа
# Модулем комплексного числа z=a+bi называется вещественное число, равное abs(z) = sqrt(a^2 + b^2)
# Такое число, равно расстоянию от точки (a;b) до начала координат, то есть до точки (0;0).


# Сложение комплексных чисел
# Пусть z1=a+bi, z2=c+di. Тогда z1+z2=(a+bi)+(c+di)=(a+c)+(b+d)i
# Пример. Пусть z1=3+2i, z2=1+7i, тогда z1+z2=(3+2i)+(1+7i)=(3+1)+(2+7)i=4+9i.


# Разность комплексных чисел
# Пусть z1=a+bi, z2=c+di. Тогда z1−z2=(a+bi)−(c+di)=(a−c)+(b−d)i
# Пример. Пусть z1=3+2i, z2=1+7i, тогда z1−z2=(3+2i)−(1+7i)=(3−1)+(2−7)i=2−5i.


# Умножение комплексных чисел
# Пусть z1=a+bi, z2=c+di. Тогда z1⋅z2=(a+bi)⋅(c+di)=ac+adi+bci+bdi^2=(ac−bd)+(ad+bc)i.
# При умножении комплексных чисел возникает i^2, значение которого равно -1.

# Пример 1. Пусть z1=3+2i, z2=1+7i, тогда z1⋅z2=(3+2i)⋅(1+7i)=(3−14)+(21+2)i=−11+23i.
# Пример 2. Пусть z=1+i, тогда z^2=z⋅z=(1+i)⋅(1+i)=(1-1)+(1+1)i=0+2i=2i.


# Сопряженные комплексные числа
# Число zˉ=a−bi называется сопряженным к числу z=a+bi. Произведение двух сопряженных чисел является вещественным числом.
# Действительно: z⋅zˉ=(a+bi)⋅(a−bi)=(a^2+b^2)+(−ab+ab)i=a^2+b^2.
# При умножении сопряженных комплексных чисел возникает i^2, значение которого равно -1.


# Деление комплексных чисел
# Пусть z1=a+bi, z2=c+di. Тогда
# (z1/z2)=(a+bi)/(c+di)=((a+bi)(c−di))/((c+di)(c−di))=((ac+bd)+(bc−ad)i)/(c^2+d^2)=((ac+bd)/(c^2+d^2))+((bc−ad)/(c^2+d^2))i.

# Таким образом, для того, чтобы поделить два комплексных числа, мы умножаем числитель и знаменатель дроби на число
# сопряженное к знаменателю, в результате в знаменателе оказывается вещественное число!

# При делении комплексных чисел возникает i^2, значение которого равно -1.

# Пример.Пусть z1=3+2i, z2=1+7i, тогда
# z1/z2=((3+2)i)/((1+7)i)=((3+2i)(1-7i))/((1+7i)(1-7i))=((3+14)+(-21+2)i)/(1^2+7^2)=(17-19i)/(50)=(17/50) - (19/50)i.



# Комплексные числа в Python
# В языке Python есть возможность работать с комплексными числами. Общая форма представления комплексного числа
# следующая: real + imag j, где
#     real – вещественная часть комплексного числа;
#     imag – мнимая часть комплексного числа, которая завершается символом j или J.

# Обратите внимание: в Python используется буква j, а не i.
z1 = 5 + 7j
z2 = 1j
z3 = -3 + 5J
z4 = 1.5 + 3.2j
print(z1, z2, z3, z4, sep='\n')  # (5+7j) 1j (-3+5j) (1.5+3.2j)
print(type(z1))                  # <class 'complex'>


# Создание комплексных чисел
# Комплексные числа можно создать с помощью литерала, как выше, а можно с помощью функции complex(), которая принимает
# два аргумента: вещественную и мнимую часть числа, либо строковое представление числа.
z1 = -3 + 2j              # создание на основе литерала
z2 = complex(6, -8)       # z2 = 6 - 8j
z3 = complex(0, 2.5)      # z3 = 2.5j
z4 = complex(5, 0)        # z4 = 5 + 0j
z5 = complex('3+4j')      # создание на основе строки
print(z1, z2, z3, z4, z5, sep='\n')  # (-3+2j) (6-8j) 2.5j (5+0j) (3+4j)


# Арифметические операции над комплексными числами
# Тип данных complex отлично интегрирован в язык Python. С complex числами работают все привычные операции:
# сложение, вычитание, умножение, деление, возведение в степень.
z1 = 1 + 3j
z2 = -3 + 2j
print('z1 + z2 =', z1 + z2)  # z1 + z2 = (-2+5j)
print('z1 - z2 =', z1 - z2)  # z1 - z2 = (4+1j)
print('z1 * z2 =', z1 * z2)  # z1 * z2 = (-9-7j)
print('z1 / z2 =', z1 / z2)  # z1 / z2 = (0.23076923076923078-0.8461538461538461j)
print('z1^20 =', z1**20)     # z1^20 = (9884965888-1512431616j)

# Мы также можем совершать арифметические операции над complex и целыми числами (миксовать complex, int, float).
z = 1 + 3j
print(z + 5)  # (6+3j)
print(z - 2)  # (-1+3j)
print(3*z)    # (3+9j)
print(z/2)    # (0.5+1.5j)

# Методы и свойства комплексных чисел
# Для получения действительной и мнимой частей комплексного числа используются свойства real и imag.
z = 3+4j
print('Действительная часть =', z.real)  # Действительная часть = 3.0
print('Мнимая часть =', z.imag)          # Мнимая часть = 4.0

# Python представляет комплексное число как два вещественных числа, поэтому при выводе у нас появились
# выражения 3.0 и 4.0 вместо 3 и 4.

# Для нахождения сопряженного комплексного числа, можно использовать метод conjugate().
z = 3+4j
print('Сопряженное число =', z.conjugate())  # Сопряженное число = (3-4j)


# Примечания
# Примечание 1. Почему используется буква j вместо буквы i, можно почитать тут.
# https://stackoverflow.com/questions/24812444/why-are-complex-numbers-in-python-denoted-with-j-instead-of-i

# Примечание 2. Для нахождения модуля комплексного числа, используется встроенная функция abs().
z = 3+4j
print('Модуль числа =', abs(z))  # Модуль числа = 5.0

# Примечание 3. Встроенный модуль math работает с вещественными числами. Для работы с комплексными числами есть модуль
# cmath. Модуль cmath включает дополнительные функции для использования комплексных чисел.
import cmath
z = 2+3j
print(cmath.phase(z)) # полярный угол
print(cmath.polar(z)) # полярные координаты

# Модуль cmath содержит следующие категории функций:
    # Экспоненциальные и логарифмические функции
    # Квадратные корни
    # Тригонометрические функции и их обратные
    # Гиперболические функции и их обратные

# Примечание 4. Документация по модулю cmath тут.
# https://docs.python.org/3/library/cmath.html

# Примечание 5. Больше примеров работы с комплексными числами тут и тут.
# https://www.askpython.com/python/python-complex-numbers
# https://www.journaldev.com/23435/python-complex-numbers-cmath

# Примечание 6. Для работы с комплексными числами (тип complex) не нужно подключать какой-либо модуль,
# в отличии от типа Decimal и Fraction.

