# Черепашья графика

# В конце 1960-х годов преподаватель Массачусетского технологического института (МIТ) Сеймур Пейперт начал использовать
# роботизированную "черепашку" для обучения студентов программированию.

# Черепашка была связана с компьютером, на котором обучаемый мог вводить команды, побуждающие черепашку перемещаться.
# У черепашки имелось перо, которое можно было поднимать и опускать. Ее можно было положить на лист бумаги и,
# программируя движение, создать рисунок.

# Python имеет систему черепашьей графики, имитирующую эту роботизированную черепашку. Система выводит на экран
# небольшой курсор (черепашку). Перемещение черепашки по экрану рисует линии и геометрические фигуры.
# Для этого используется модуль turtle.


# Модуль turtle
# Система черепашьей графики не встроена в интерпретатор Python и хранится в модуле turtle. В начале программы с
# использованием черепашьей графики пишут инструкцию импорта этого модуля:
import turtle

# Для визуализации черепашьей графики мы будем использовать онлайн среду trinket.
# https://trinket.io/


# Рисование отрезков прямой
# В результате команды turtle.showturtle() появляется графическое окно с черепашкой. Черепашка первоначально расположена
# в центре графического окна, "холста". Выглядит она как стрелка с острием на месте головы. Если дать черепашке команду
# двигаться вперед, она переместится в направлении, указываемом стрелкой.

# По умолчанию на старте черепашка смотрит на восток.

# Для перемещения черепашки вперед на n пикселей применяется команда turtle.forward(n).
# Например, команда turtle.forward(100) переместит черепашку вперед на 100 пикселей.

# Для перемещения черепашки назад на n пикселей применяется команда turtle.backward(n).
# Например, команда turtle.backward(250) переместит черепашку назад на 250 пикселей.


# Поворот черепашки
# Когда черепашка появляется, она по умолчанию направлена на восток, то есть вправо, или под углом 0 градусов.

# При помощи команд turtle.right() и turtle.left() можно повернуть черепашку:
#     команда turtle.right(angle) поворачивает черепашку вправо на angle градусов;
#     команда turtle.left(angle) поворачивает черепашку влево на angle градусов.

# Рассмотрим программный код:
import turtle
turtle.forward(100)
turtle.right(90)
turtle.forward(100)

# Такой код перемещает черепашку на 100 пикселей вперед. Далее он поворачивает черепашку на 90 вправо (черепашка будет
# смотреть вниз). Затем он перемещает черепашку на 100 пикселей вперед.

# Рассмотрим программный код с использованием команды turtle.left():
import turtle
turtle.forward(100)
turtle.left(120)
turtle.forward(100)

# Такой код сначала перемещает черепашку на 100 пикселей вперед. Затем он поворачивает черепашку на 120 влево (черепашка
# будет смотреть на северо-запад). И далее он перемещает черепашку на 100 пикселей вперед.

# Команды turtle.right() и turtle.left() поворачивают черепашку на указанный угол от ее направления в этот момент, а не
# от исходного. К примеру, текущее угловое направление составляет 90, строго на север. Если ввести команду
# turtle.left(20), то черепашка повернется влево на 20. Ее новое угловое направление составит 110, по отношению к
# начальному положению, когда угол равен 0.

# В качестве еще одного примера рассмотрим код:
import turtle
turtle.forward(50)
turtle.left(45)
turtle.forward(50)
turtle.left(45)
turtle.forward(50)
turtle.left(45)
turtle.forward(50)

# В начале направление черепашки составляет 0. Далее черепашка перемещается на 50 пикселей вперед и поворачивается на 45
# влево. Затем еще дважды повторяет перемещение вперед на 50 пикселей и поворот на 45 влево. После всех этих поворотов
# угловое направление черепашки составит 135.


# Установка углового направления черепашки
# оманда turtle.setheading() применяется для установки углового направления черепашки с заданным углом. В качестве
# аргумента нужно указать желаемый угол.
import turtle
turtle.forward(100)
turtle.setheading(90)
turtle.forward(100)
turtle.setheading(180)
turtle.forward(100)
turtle.setheading(270)
turtle.forward(100)

# Первоначальное угловое направление черепашки составляет 0. Далее установлено направление черепашки 90 (на север).
# Затем установлено направление черепашки 180 (на запад). Потом установлено направление черепашки 270 (на юг).


# Получение текущего углового направления черепашки
# Чтобы получить текущее угловое направление черепашки используется команда turtle.heading().
import turtle
print(turtle.heading())
turtle.setheading(180)
print(turtle.heading())


# Изменение внешнего вида черепашки
# По умолчанию черепашка выглядит как стрелочка, но возможен и другой внешний вид. Для его изменения используют команду
# shape(). Команда принимает в качестве аргумента строковое название фигуры, определяющей форму черепашки.
# Доступные фигуры:
#     square (квадрат);
#     arrow (стрелка);
#     circle (круг);
#     turtle (черепашка);
#     triangle (треугольник);
#     classic (классическая стрелка).
import turtle
turtle.shape('square')
turtle.forward(100)
turtle.setheading(90)
turtle.shape('arrow')
turtle.forward(100)
turtle.setheading(180)
turtle.shape('turtle')
turtle.forward(100)
turtle.setheading(270)
turtle.shape('circle')
turtle.forward(100)

# При необходимости можно использовать собственные рисунки для создания внешнего вида черепашки.
import turtle
turtle.Screen().addshape('rocketship.gif')  # регистрируем изображение
turtle.shape('rocketship.gif')              # устанавливаем изображение
for _ in range(4):
  turtle.forward(150)
  turtle.left(90)


# Примечания
# Примечание 1. Полная документация по черепашьей графике находится тут. Рекомендуем с ней ознакомиться.
# https://docs.python.org/3/library/turtle.html

# Примечание 2. Не весь функционал черепашки доступен в Trinket. Подробности в разделе turtle.
# https://trinket.io/embed/python/8eb5179d7f

# Примечание 3. Все рассмотренные команды являются методами класса Turtle (ООП).

# Примечание 4. Можно настроить размер шрифта в Trinket.
