# Множества в математике
# В математике множество – совокупность объектов, понимаемых как единое целое.
# При этом предполагается, что объекты данной совокупности можно отличать друг от друга и от объектов, не входящих в эту
# совокупность. Например, можно говорить:
#   - о множестве всех студентов данного курса;
#   - множестве всех языков программирования;
#   - множестве всех натуральных чисел;
#   - множестве всех точек данного отрезка.
# Студенты данного курса, языки программирования, натуральные числа, точки данного отрезка – элементы соответствующих
# множеств.


# Обозначения
# Обычно множества обозначают большими латинскими буквами: X, Y, …, а элементы множеств – латинскими строчными буквами:
# x, y, ….
# Элементы множества указываются в фигурных скобках.

# Рассмотрим множество вещей: {худи, кепка, футболка}. Такое множество содержит три элемента.


# Конечные и бесконечные множества
# Рассмотрим три множества:
#     A = {a, b, c, …, z} – множество букв английского алфавита;
#     B = {Тимур, Руслан, Роман, Оля} – множество имён авторов данного курса;
#     N = {1, 2, 3, 4, 5, …} – множество натуральных чисел.
# Первые два множества содержат конечное количество элементов и являются конечными множествами. Третье же множество
# содержит бесконечно много элементов, поэтому и называется бесконечным множеством.


# Равенство множеств
# Если два множества X и Y состоят из одних и тех же элементов, то они называются равными X =Y.
# Например, если X ={a,b,с,d} и Y ={b,d,c,a}, то X=Y. Обратите внимание, порядок расположения элементов в записи
# множеств при их сравнении во внимание не принимается.
# Еще один пример, X={1,2,3,4,5} и Y={множество натуральных чисел меньших 6}. Очевидно, такие множества содержат
# абсолютно одинаковые элементы, поэтому равны.


# Подмножество и надмножество
# Если все элементы множества X принадлежат также и множеству Y, то говорят, что X является подмножеством Y,
# а записывается это так: X ⊂ Y.
# Например, X={1,2,3}, Y={1,2,3,4,5}. Так как все элементы множества X содержатся в множестве Y, то мы говорим, что
# множество X является подмножеством множества Y.

# Множество X={1,2,3,6} не является подмножеством множества Y={1,2,3,4,5}, так как элемент 6 не содержится в Y.
# Если множество X является подмножеством множества Y, то также говорят, что множество Y является надмножеством
# множества X, а записывается это так: Y ⊃ X.
# Заметим, что любое множество также является подмножеством самого себя. Про такое подмножество говорят нестрогое
# подмножество:
#     множество {1,2,3} является нестрогим подмножеством множества {1,2,3};
#     множество {1,2,3} является строгим подмножеством множества {1,2,3,4}.


# Пустое множество
# Для удобства работы с множествами и записи с их помощью различных математических высказываний, вводится понятие
# множества, не содержащего ни одного элемента. Оно называется пустым множеством и обозначается ∅.

# Пустое множество является подмножеством любого множества.


# Примечания
# Примечание 1. Множества – неупорядоченные совокупности, то есть, неважно в каком порядке указаны элементы множества.

# Примечание 2. Если множество X конечно, то через ∣X∣ обозначается количество элементов множества X.

# Примечание 3. Если множество X содержит n элементов, то оно имеет (2 ** n) подмножеств, включая пустое множество.
# Например, множество X={a,b,c} содержит 3 элемента и имеет 8 подмножеств:
#   1. {∅};
#   2. {a};
#   3. {b};
#   4. {c};
#   5. {a,b};
#   6. {a,c};
#   7. {b,c};
#   8. {a,b,c}.

# Примечание 4. Раздел математики, занимающийся множествами, называется теорией множеств. Возникла эта теория во второй
# половине XIX века, главным образом в трудах немецкого математика Г. Кантора. Кантор определял множество как "любое
# собрание определенных и различимых между собой объектов нашей интуиции или интеллекта, мыслимое как единое целое".


# Числовые множества
# К основным числовым множествам математики относятся:
#     множество натуральных чисел;
#     множество целых чисел;
#     множество рациональных чисел;
#     множество вещественных чисел;
#     множество комплексных чисел.

# Натуральные числа
# Исторически первыми появились натуральные числа, предназначенные для подсчёта материальных объектов
# (овец, кур, монет и т.д.). Множество натуральных чисел обозначается буквой N и содержит следующие числа:
# N={1,2,3,4,5,…}.
# Обратите внимание, число ноль не является натуральным числом.

# Целые числа
# Если к множеству натуральных чисел N присоединить те же числа с противоположным знаком и ноль, то получится множество
# целых чисел. Множество целых чисел обозначается буквой Z и содержит следующие числа:
# Z={0,±1,±2,±3,±4,±5,…}.
# Множество натуральных чисел является подмножеством множества целых чисел, поскольку каждый элемент множества N
# принадлежит множеству Z.
# Множество натуральных чисел – подмножество множества целых чисел N ⊂ Z.

# Рациональные числа
# Рациональным числом в математике называется любое число, представимое в виде частного двух целых чисел с отличным от
# нуля знаменателем. Множество рациональных чисел обозначается буквой Q и содержит следующие числа:
# Q={m/n, m ∈ Z, n ∈ N}.
# Множество целых чисел является подмножеством множества рациональных чисел, так как любое целое число можно представить
# в виде дроби со знаменателем, равным 1.
# Любое рациональное число это либо конечная, либо бесконечная периодическая десятичная дробь.
# К примеру:
#   1 / 2 = 0.5 – конечная непериодическая дробь;
#   3 / 8 = 0.375 – конечная непериодическая дробь;
#   1 / 3 = 0.(3) – бесконечная периодическая десятичная дробь;
#   7 / 11 = 0.(63) – бесконечная периодическая десятичная дробь.

# Иррациональные числа
# Не все числа в математике можно представить в виде рационального числа. Примером служат числа:
#   2 ** 0.5 ≈ 1.414213562…;
#   Pi ≈ 3.1415926535…;
#   e ≈ 2.71828182845….
# Такие числа называются иррациональными и являются бесконечными непериодическими дробями. Иными словами,
# в «бесконечных хвостах» иррациональных чисел нет никакой закономерности.
# Иррациональные числа часто обозначают буквой I.

# Вещественные числа
# Объединение рациональных и иррациональных чисел образует множество вещественных чисел. Множество вещественных чисел R
# определяется так: R=Q ∪ I, где символ ∪ – означает объединение множеств.
# Геометрическая интерпретация множества вещественных чисел – это числовая прямая.
# Каждому вещественному числу соответствует определённая точка числовой прямой, и наоборот – каждой точке числовой
# прямой обязательно соответствует некоторое вещественное число.
# Множество вещественных чисел также называют множеством действительных чисел.

# Множество комплексных чисел
# Комплексным числом в математике называется любое число, представимое в виде a+bi, где a и b – вещественные числа,
# а i=(-1) ** 0.5 – мнимая единица. Множество комплексных чисел обозначается буквой C.
#  Множество вещественных чисел является подмножеством множества комплексных чисел, так как любое вещественное число
#  можно представить в виде a+bi, где b = 0.


# Несложно заметить, что каждое следующее множество является надмножеством предыдущего множества, так как содержит все
# его элементы: N ⊂ Z ⊂ Q ⊂ R ⊂ C.

