# Подмножества и надмножества
# Напомним, что множество set1 является подмножеством множества set2, если все элементы первого входят во второе.
# При этом множество set2 – надмножество множества set1.
# Любое множество – подмножество самого себя, про такое подмножество говорят "нестрогое подмножество".


# Метод issubset()
# Для определения, является ли одно из множеств подмножеством другого, используется метод issubset(). Данный метод
# возвращает значение True, если одно множество является подмножеством другого, и False, если не является.
set1 = {2, 3}
set2 = {1, 2, 3, 4, 5, 6}
print(set1.issubset(set2))  # True

# В этом примере set1 содержит все элементы set2. Это означает, что set1 – надмножество set2. Это также означает, что
# set2 – подмножество set1.

# Для определения, является ли одно из множеств надмножеством другого, также применяются операторы
# >= (нестрогое надмножество) и > (строгое надмножество).
set1 = {'a', 'b', 'c', 'd', 'e'}
set2 = {'c', 'e'}
print(set1 >= set2)  # True


# Метод isdisjoint()
# Для определения отсутствия общих элементов в множествах используется метод isdisjoint(). Данный метод возвращает
# значение True, если множества не имеют общих элементов, и False, когда множества имеют общие элементы.
set1 = {1, 2, 3, 4, 5}
set2 = {5, 6, 7}
set3 = {7, 8, 9}
print(set1.isdisjoint(set2))  # False
print(set1.isdisjoint(set3))  # True
print(set2.isdisjoint(set3))  # False


# Примечания
# Примечание 1. Методы issuperset(), issubset(), isdisjoint() могут принимать в качестве аргумента не только множество
# (тип данных set), но и любой итерируемый объект (список, строку, кортеж).

# Примечание 2. Операторы >, <, >=, <= требуют наличия в качестве операндов множеств.

# Примечание 3. Таблица соответствия методов и операторов над множествами.
# set1 <= set2            Возвращает True, если set1 является подмножеством set2
# set1.issubset(set2)

# set1 >= set2            Возвращает True, если set1 является надмножеством set2
# set1.issuperset(set2)

# set1 < set2             Эквивалентно set1 <= set2 and set1 != set2 (строгое подмножество)

# set1 > set2             Эквивалентно set1 >= set2 and set1 != set2 (строгое надмножество)
