# Диаграммы Эйлера-Венна
# Диаграммы Эйлера-Венна – геометрическое представление множеств. Большой прямоугольник представляет универсальное
# множество U, а круги в нем – отдельные множества. Круги пересекаются в соответствии с условиями задачи. Точки внутри
# областей диаграммы — элементы соответствующих множеств. На диаграмме можно заштриховать образованные при пересечении
# кругов множества.


# Операции над множествами
# Операции над множествами выполняются для получения новых множеств из уже существующих.
# Основные операции над множествами:
#     объединение;
#     пересечение;
#     разность;
#     симметрическая разность;
#     дополнение.

# Объединение множеств
# Объединение множеств – множество, состоящее из элементов, принадлежащих хотя бы одному из объединяемых множеств.
# Для объединения множеств используется символ ∪.
# Например, если X={1,2,3,4,5}, Y={3,4,7,8,9}, то X ∪ Y={1,2,3,4,5,7,8,9}.
# Часто операцию объединения множеств отождествляют с операцией сложения.

# Пересечение множеств
# Пересечение множеств – множество, состоящее из элементов, принадлежащих одновременно каждому из пересекающихся
# множеств.
# Для пересечения множеств используется символ ∩.
# Например, если X={1,2,3,4,5}, Y={3,4,7,8,9}, то X ∩ Y={3,4}.
# Часто операцию пересечения множеств отождествляют с операцией умножения.

# Разность множеств
# Разность множеств – множество, в которое входят только элементы первого множества, не входящие во второе множество.
# Для разности множеств используется символ \.
# Например, если X={1,2,3,4,5},Y={3,4,7,8,9}, то X\Y={1,2,5}.

# Симметрическая разность
# Симметрическая разность множеств – множество, включающее все элементы исходных множеств, не принадлежащие одновременно
# обоим исходным множествам. Другими словами, симметрическая разность это множество (X ∪ Y) \ (X ∩ Y).
# Для симметрической разности множеств используется символ △.
# Например, если X={1,2,3,4,5},Y={3,4,7,8,9}, то X △ Y={1,2,5,7,8,9}.

# Дополнение
# Дополнение множества – множество всех элементов, в нем не содержащихся.
# Для операции дополнения множества используется символ ¬.

# Примечания
# Примечание 1. Предположим, что изучается некоторая область знаний. Множество всех элементов исследуемой области
# называется универсальным. На диаграммах универсальное множество обычно изображается множеством точек некоторого
# прямоугольника плоскости, а принадлежащие ему подмножества – кругами внутри прямоугольника.
