# Функции как объекты
# До сих пор мы рассматривали функции как совершенно отдельный элемент языка со своим синтаксисом и механизмом работы.
# Но, оказывается, функции также что-то вроде особого типа объектов. Бывают числа, строки, списки, кортежи, словари,
# множества. А бывают — функции. У каждого из этих типов есть свои операции, свой синтаксис, но все они — объекты.

# Напомним, что язык Python мультипарадигменный, он одинаково хорошо поддерживает и функциональную и
# объектно-ориентированную парадигмы программирования.
num = 17
numbers = [1, 2, 3]
colors = (1, 2, 3)
name = 'Python'
print(type(num))        # <class 'int'>
print(type(numbers))    # <class 'list'>
print(type(colors))     # <class 'tuple'>
print(type(name))       # <class 'str'>

# Таким образом, целое число — объект типа int, список — объект типа list, кортеж — объект типа tuple, строка — объект
# типа str и т.д.
# Любая функция в языке Python — объект типа function.
print(type(print))  # <class 'builtin_function_or_method'>
print(type(sum))    # <class 'builtin_function_or_method'>
print(type(abs))    # <class 'builtin_function_or_method'>

# Python выдает нам строку <class 'builtin_function_or_method'>, которая поясняет, что print, sum, abs — встроенные
# функции языка, или методы.

# Обратите внимание: скобки не ставим при передаче аргумента в функцию type(), мы не вызываем функцию, а передаем ее
# название.

# Мы также можем объявить свою функцию, которая тоже является объектом.
def hello():
    print('Hello from function')
print(type(hello))  # <class 'function'>

# В языке Python все объект: число, строка, список, кортеж, множество, словарь, даже функция.

# Поскольку функции тоже объекты, работать с ними можно и как с объектами: записывать их в переменные, передавать в
# качестве аргументов другим функциям, возвращать из функций и т.д.
def hello():
    print('Hello from function')
func = hello     #  присваиваем переменной func функцию hello
func()           #  вызываем функцию

# Таким образом, теперь переменную func можно использовать как функцию hello().

# Рассмотрим еще один пример. Если по какой-либо причине вам не нравится название встроенной функции print(), которая
# выводит указанный текст на экран, можно написать такой код:
writeln = print             # как в языке Pascal 😀
writeln('Hello world!')     # Hello world!
writeln('Python')           # Python

# Возможность записать функцию в переменную позволяет гибко управлять тем, какую функциональность мы хотим использовать.
# В одну и ту же переменную можно записать разные варианты поведения и менять их при необходимости. При этом не только
# не нужно будет менять код по всей программе, но и не придется даже изменять код функций. Достаточно переменной
# присвоить вместо одной функции — другую.

# Представим себе ситуацию, когда необходимо выполнить некую функцию, если задано имя команды. Для простоты предположим,
# если пришла команда start — надо выполнить функцию start(), если команда stop — функцию stop(), если команда pause —
# функцию pause().

# Такую логику легко можно написать при помощи условного оператора if .. elif.
def start():
    pass # тело функции start
def stop():
    pass # тело функции stop
def pause():
    pass # тело функции pause
command = input()        # считываем название команды
if command == 'start':
    start()
elif command == 'stop':
    stop()
elif command == 'pause':
    pause()

# Однако если команд будет много или, если их количество будет увеличиваться, то оператор if получится слишком
# громоздким. В этом случае можно создать словарь, где ключом служит название команды, а значением — соответствующая
# функция.
# Приведенный ниже код решает ту же самую задачу, но более гибко:
def start():
    pass # тело функции start
def stop():
    pass # тело функции stop
def pause():
    pass # тело функции pause
commands = {'start': start, 'stop': stop, 'pause': pause}  # словарь соответствия команда → функция
command = input()        # считываем название команды
commands[command]()      # вызываем нужную функцию через словарь по ключу

# Таким образом вся логика обработчика команды сводится к очень простой строке:
commands[command]()
# где переменная command — имя команды, которую надо выполнить. Такой код намного гибче!


# Функции в качестве аргументов других функций
# Возможность присваивать имя функции переменной позволяет, в частности, передавать имя функции аргументом другой
# функции. Это доступно во многих языках, но в Python проще, благодаря его гибкой типизации.

# Это позволяет легко и красиво решать сложные задачи. Классическая иллюстрация – математические задачи, где
# функциональная зависимость играет роль внешнего фактора.

# Например, есть программная функция построения графика для заданной математической функции. Если нужно строить графики
# многих математических функций, то каждый раз придется писать новую функцию, или модифицировать имеющуюся.

# Но логика построения графика функции практически не зависит от типа математической функции, поэтому можно
# рассматривать математическую функцию как аргумент программной функции построения графика. Определим функцию plot(),
# которая принимает 3 аргумента: f – функцию, для которой хотим построить график, и a, b – границы диапазона построения
# графика.
def plot(f, a, b):
    pass

# При запуске функции plot() мы можем указать, для какой именно функции строим график. Например, пусть у нас есть
# следующие математические функции:
def square_add_one(x):
    return x * x + 1
def cube_add_square(x):
    return x ** 3 + x ** 2

# Чтобы нарисовать график функции y=x^2+1 в диапазоне [1;10] достаточно выполнить функцию plot() со следующими
# аргументами: plot(square_add_one, 1, 10).

# Аналогично, вызов функции plot(cube_add_square, -10, 10) построит график функции y=x^3+x^2 в диапазоне [−10;10].

# Логику работы функции plot() не нужно менять, достаточно передать ей функциональный объект, используемый внутри. Такой
# подход работает во многих популярных библиотеках Python. В библиотечные функции мы передаем ту логику, которая нужна
# нам, вместо стандартной, реализованной в библиотеке.

# Функции, способные в качестве аргумента принимать или/и возвращать другие функции, называются функциями высшего
# порядка.


# Встроенные функции, принимающие функции в качестве аргументов
# В прошлых уроках мы изучили встроенные функции:
#     min(): поиск минимального элемента;
#     max(): поиск максимального элемента;
#     sorted(): сортировка данных.

# Не путайте списочный метод sort() и встроенную функцию sorted(). Они работают одинаково, но списочный метод sort()
# сортирует список на месте, а функция sorted() возвращает новый, отсортированный список.

# Продемонстрируем работу функций на примере:
numbers = [10, -7, 8, -100, -50, 32, 87, 117, -210]
print(max(numbers))     # 117
print(min(numbers))     # -210
print(sorted(numbers))  # [-210, -100, -50, -7, 8, 10, 32, 87, 117]

# Но что, если мы хотим написать код для поиска максимального по модулю элемента списка numbers? И вообще, сравнивать
# элементы не стандартным способом, а более специфическими?

# На этот случай все выше перечисленные встроенные функции могут принимать необязательный аргумент key – функцию,
# определяющую условия сравнения элементов. Другими словами, значение key должно быть функцией, принимающей один
# аргумент и возвращающей на его основе ключ для сравнения.

# Функция, определяющая условия сравнения элементов, называется компаратор (compare – сравнивать).

# Встроенные функции min(), max(), sorted() – функции высшего порядка, так как принимают в качестве аргумента функцию
# сравнения элементов.

# Продемонстрируем вышесказанное на примере кода:
numbers = [10, -7, 8, -100, -50, 32, 87, 117, -210]
print(max(numbers, key=abs))        #  указываем функцию abs в качестве компаратора
print(min(numbers, key=abs))        #  указываем функцию abs в качестве компаратора
print(sorted(numbers, key=abs))     #  указываем функцию abs в качестве компаратора

# Приведенный выше код выводит:
-210                                         # максимальный по модулю элемент
-7                                           # минимальный по модулю элемент
[-7, 8, 10, 32, -50, 87, -100, 117, -210]    # сортировка на основании модулей элементов

# Рассмотрим еще один пример.
# Пусть в списке points хранятся в виде кортежей координаты точек плоскости в двумерной биполярной системе координат.
points = [(1, -1), (2, 3), (-10, 15), (10, 9), (7, 18), (1, 5), (2, -4)]

# При использовании встроенной функции sorted() (или списочного метода sort()) сортировка пройдет по первым значениям
# пар кортежа, а в случае их совпадения, по вторым.
# Таким образом, приведенный ниже код выводит:
points = [(1, -1), (2, 3), (-10, 15), (10, 9), (7, 18), (1, 5), (2, -4)]
points.sort()    #  сортируем список точек на месте
print(points)    # [(-10, 15), (1, -1), (1, 5), (2, -4), (2, 3), (7, 18), (10, 9)]

# Рассмотрим следующий код:
def compare_by_second(point):
    return point[1]
def compare_by_sum(point):
    return point[0] + point[1]
points = [(1, -1), (2, 3), (-10, 15), (10, 9), (7, 18), (1, 5), (2, -4)]
print(sorted(points, key=compare_by_second))   # сортируем по второму значению кортежа
print(sorted(points, key=compare_by_sum))      # сортируем по сумме кортежа

# Он выводит:
[(2, -4), (1, -1), (2, 3), (1, 5), (10, 9), (-10, 15), (7, 18)]
[(2, -4), (1, -1), (2, 3), (-10, 15), (1, 5), (10, 9), (7, 18)]


# Функции в качестве возвращаемых значений других функций
# Объектная сущность функций позволяет и передавать их в качестве аргументов в другие функции, и возвращать одни функции
# из других. То есть, функции могут быть результатом работы других функций, что позволяет писать генераторы функций,
# возвращающие функции в зависимости от передаваемых им аргументов.

# Рассмотрим код, где функция generator() возвращает функцию hello() в качестве результата своей работы.
def generator():
    def hello():
        print('Hello from function!')
    return hello

# Результат работы функции generator() можно записать в переменную, и использовать эту переменную как функцию.
func = generator()
func()  # Hello from function!

# В Python можно определять функцию внутри функции, ведь функция это объект.

# Приведенный выше пример не очень информативен, но идею можно использовать и для построения более мощных генераторов
# функций. Например, рассмотрим семейство функций — квадратных трехчленов. Все эти функции имеют один и тот же вид
# f(x)=a*x^2+b*x+c, но поведение конкретного квадратного трехчлена зависит от значения параметров a,b,c. Мы можем
# написать генератор функций, который по параметрам a,b,c, построит и вернет нам конкретный квадратный трехчлен:
def generator_square_polynom(a, b, c):
    def square_polynom(x):
        return a*x**2 + b*x + c
    return square_polynom
f = generator_square_polynom(a=1, b=2, c=1)
g = generator_square_polynom(a=2, b=0, c=-3)
h = generator_square_polynom(a=-3, b=-10, c=50)
print(f(1))     # 4
print(g(2))     # 5
print(h(-1))    # 57

# Другими словами мы построили функции f(x)=x^2+2x+1, g(x)=2x^2-3, h(x)=-3x^2-10x+50.

# Обратите внимание на то, что внутренняя функция square_polynom() использует параметры внешней функции
# generator_square_polynom(). Такую вложенную функцию называют замыканием.

# Замыкания – вложенные функции, ссылающиеся на переменные, объявленные вне определения этой функции, и не являющиеся
# её параметрами.


# Примечания
# Примечание 1. Функция sorted() и списочный метод sort() помимо необязательного аргумента key, принимают еще аргумент
# reverse, который по умолчанию имеет значение False, что соответствует сортировке по возрастанию. Если значение reverse
# установить в True, произойдет сортировка по убыванию.

# Примечание 2. Сортировка при помощи функции sorted() и списочного метода sort() стабильна, то есть гарантирует
# неизменность взаиморасположения равных между собой элементов.
def comparator(item):
    return item[0]
data = [('red', 1), ('blue', 2), ('green', 5), ('blue', 1)]
data.sort(key=comparator)   # сортируем по первому полю
print(data)                 # [('blue', 2), ('blue', 1), ('green', 5), ('red', 1)]

# Обратите внимание, что две записи с 'blue' сохранили начальный порядок.

# Примечание 3. Функции max() и min() возвращают первый максимальный или минимальный элемент, если таковых несколько.

# Примечание 4. Надо четко понимать что сделает код print(input()) и почему это отличается от print(input).
# Код print(input()) запросит у пользователя текст и тут же его напечатает, т.к. функция input() будет вызвана.
# Код print(input) выдаст нам текстовое представление этой функции: строку built-in function input, которая поясняет,
# что input — встроенная функция языка.
